# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и через dict.
# month = input("Месяц: ")
lst = ["зима"] * 2 + ["весна"] * 3 + ["лето"] * 3 + ["осень"] * 3 + ["зима"]
month = int(input("Номер месяца от 1 до 12: "))
print(lst[month - 1])

dic = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна", 6: "лето", 7: "лето", 8: "лето", 9: "осень",
       10: "осень", 11: "осень", 12: "зима"}
month1 = int(input("Номер месяца от 1 до 12: "))
print(dic.get(month1))
